# Pandas - Data Cleaning

1. Renaming Columns
2. Re-arranging Column Order
3. Checking data types of specific columns
4. Removing Text from column
5. Deaing with Missing Data
6. Changing Data Types
7. Replacing Text within a column
8. String operations of column data
9. Removing Columns
10. Dropping Rows

In [ ]:
# Let's load a new dataset on the number of fires in the Amazon rainforest 

import pandas as pd

file_name = "https://raw.githubusercontent.com/rajeevratan84/datascienceforbusiness/master/amazon_fires.csv"
df = pd.read_csv(file_name, encoding = "ISO-8859-1")

df.tail()

       ano       mes     estado numero  encontro
6449  2012  Dezembro  Tocantins    128  1/1/2012
6450  2013  Dezembro  Tocantins     85  1/1/2013
6451  2014  Dezembro  Tocantins    223  1/1/2014
6452  2015  Dezembro  Tocantins    373  1/1/2015
6453  2016  Dezembro  Tocantins    119  1/1/2016

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6454 entries, 0 to 6453
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   ano       6454 non-null   int64
 1   mes       6454 non-null   object
 2   estado    6454 non-null   object
 3   numero    6322 non-null   object
 4   encontro  6454 non-null   object
dtypes: int64(1), object(4)
memory usage: 252.2+ KB

In [ ]:
# How many regions are in the dataset?

df['estado'].unique()

array(['Acre', 'alagoas', 'Amapa', 'Amazonas', 'Bahia', 'Ceara',
       'Distrito Federal', 'Espirito Santo', 'Goias', 'Maranhao',
       'Mato Grosso', 'Minas Gerais', 'par√°', 'Paraiba', 'Pernambuco',
       'Piau', 'Rio', 'rondonia', 'Roraima', 'Santa Catarina',
       'Sao Paulo', 'Sergipe', 'Tocantins'], dtype=object)

In [ ]:
df.columns

Index(['ano', 'mes', 'estado', 'numero', 'encontro'], dtype='object')

# Renaming Columns

In [ ]:
new_columns = {'ano' : 'year',
               'estado': 'state',
               'mes': 'month',
               'numero': 'number_of_fires',
               'encontro': 'date'}

df.rename(columns = new_columns, inplace=True)

In [ ]:
df.head()

   year    month state number_of_fires      date
0  1998  Janeiro  Acre         0 Fires  1/1/1998
1  1999  Janeiro  Acre         0 Fires  1/1/1999
2  2000  Janeiro  Acre         0 Fires  1/1/2000
3  2001  Janeiro  Acre         0 Fires  1/1/2001
4  2002  Janeiro  Acre         0 Fires  1/1/2002

In [ ]:
# How many years of data do we have?
df['year'].unique()

array([1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008,
       2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017])

In [ ]:
# Let's explore our datetypes, we should expect number_of_types to be an integer or float datatype

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6454 entries, 0 to 6453
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   year             6454 non-null   int64
 1   month            6454 non-null   object
 2   state            6454 non-null   object
 3   number_of_fires  6322 non-null   object
 4   date             6454 non-null   object
dtypes: int64(1), object(4)
memory usage: 252.2+ KB

In [ ]:
df.isnull().sum()

year                 0
month                0
state                0
number_of_fires    132
date                 0
dtype: int64

In [ ]:
df.head()

   year    month state number_of_fires      date
0  1998  Janeiro  Acre         0 Fires  1/1/1998
1  1999  Janeiro  Acre         0 Fires  1/1/1999
2  2000  Janeiro  Acre         0 Fires  1/1/2000
3  2001  Janeiro  Acre         0 Fires  1/1/2001
4  2002  Janeiro  Acre         0 Fires  1/1/2002

In [ ]:
df.columns

Index(['year', 'month', 'state', 'number_of_fires', 'date'], dtype='object')

# Re-arranging columns

In [ ]:
# Columns are numbered from 0, left to right
# Let's put date first, month second and year 3rd

new_order = [4,1,0,2,3,]
df = df[df.columns[new_order]]
df.head()

       date    month  year state number_of_fires
0  1/1/1998  Janeiro  1998  Acre         0 Fires
1  1/1/1999  Janeiro  1999  Acre         0 Fires
2  1/1/2000  Janeiro  2000  Acre         0 Fires
3  1/1/2001  Janeiro  2001  Acre         0 Fires
4  1/1/2002  Janeiro  2002  Acre         0 Fires

In [ ]:
df.head(25)

        date      month  year state number_of_fires
0   1/1/1998    Janeiro  1998  Acre         0 Fires
1   1/1/1999    Janeiro  1999  Acre         0 Fires
2   1/1/2000    Janeiro  2000  Acre         0 Fires
3   1/1/2001    Janeiro  2001  Acre         0 Fires
4   1/1/2002    Janeiro  2002  Acre         0 Fires
5   1/1/2003    Janeiro  2003  Acre        10 Fires
6   1/1/2004    Janeiro  2004  Acre         0 Fires
7   1/1/2005    Janeiro  2005  Acre        12 Fires
8   1/1/2006    Janeiro  2006  Acre         4 Fires
9   1/1/2007    Janeiro  2007  Acre         0 Fires
10  1/1/2008    Janeiro  2008  Acre         0 Fires
11  1/1/2009    Janeiro  2009  Acre         0 Fires
12  1/1/2010    Janeiro  2010  Acre         1 Fires
13  1/1/2011    Janeiro  2011  Acre         0 Fires
14  1/1/2012    Janeiro  2012  Acre         0 Fires
15  1/1/2013    Janeiro  2013  Acre         0 Fires
16  1/1/2014    Janeiro  2014  Acre         0 Fires
17  1/1/2015    Janeiro  2015  Acre         1 Fires
18  1/1/2016    Janeiro  2016  Acre        12 Fires
19  1/1/2017    Janeiro  2017  Acre         0 Fires
20  1/1/1998  Fevereiro  1998  Acre         0 Fires
21  1/1/1999  Fevereiro  1999  Acre         0 Fires
22  1/1/2000  Fevereiro  2000  Acre         0 Fires
23  1/1/2001  Fevereiro  2001  Acre         0 Fires
24  1/1/2002  Fevereiro  2002  Acre         1 Fires

In [ ]:
df[df['number_of_fires'].isnull() == True]

          date     month  year      state number_of_fires
68    1/1/2006     Abril  2006       Acre             NaN
110   1/1/2008     Junho  2008       Acre             NaN
127   1/1/2005     Julho  2005       Acre             NaN
206   1/1/2004  Novembro  2004       Acre             NaN
217   1/1/2015  Novembro  2015       Acre             NaN
...        ...       ...   ...        ...             ...
6305  1/1/2008      Maio  2008  Tocantins             NaN
6354  1/1/2017     Julho  2017  Tocantins             NaN
6383  1/1/2006  Setembro  2006  Tocantins             NaN
6415  1/1/1998  Novembro  1998  Tocantins             NaN
6428  1/1/2011  Novembro  2011  Tocantins             NaN

[132 rows x 5 columns]

In [ ]:
df.tail(50)

      year     month      state number_of_fires      date
6404  2007   Outubro  Tocantins           2.252  1/1/2007
6405  2008   Outubro  Tocantins           2.832  1/1/2008
6406  2009   Outubro  Tocantins             718  1/1/2009
6407  2010   Outubro  Tocantins           2.272  1/1/2010
6408  2011   Outubro  Tocantins           1.591  1/1/2011
6409  2012   Outubro  Tocantins            3.68  1/1/2012
6410  2013   Outubro  Tocantins           2.155  1/1/2013
6411  2014   Outubro  Tocantins               4  1/1/2014
6412  2015   Outubro  Tocantins           4.844  1/1/2015
6413  2016   Outubro  Tocantins           2.032  1/1/2016
6414  2017   Outubro  Tocantins           2.969  1/1/2017
6415  1998  Novembro  Tocantins             NaN  1/1/1998
6416  1999  Novembro  Tocantins              29  1/1/1999
6417  2000  Novembro  Tocantins              96  1/1/2000
6418  2001  Novembro  Tocantins             100  1/1/2001
6419  2002  Novembro  Tocantins             207  1/1/2002
6420  2003  Novembro  Tocantins             146  1/1/2003
6421  2004  Novembro  Tocantins             424  1/1/2004
6422  2005  Novembro  Tocantins             271  1/1/2005
6423  2006  Novembro  Tocantins             108  1/1/2006
6424  2007  Novembro  Tocantins             147  1/1/2007
6425  2008  Novembro  Tocantins             104  1/1/2008
6426  2009  Novembro  Tocantins             251  1/1/2009
6427  2010  Novembro  Tocantins             283  1/1/2010
6428  2011  Novembro  Tocantins             NaN  1/1/2011
6429  2012  Novembro  Tocantins             179  1/1/2012
6430  2013  Novembro  Tocantins             345  1/1/2013
6431  2014  Novembro  Tocantins             451  1/1/2014
6432  2015  Novembro  Tocantins             833  1/1/2015
6433  2016  Novembro  Tocantins             623  1/1/2016
6434  2017  Novembro  Tocantins             434  1/1/2017
6435  1998  Dezembro  Tocantins               9  1/1/1998
6436  1999  Dezembro  Tocantins              16  1/1/1999
6437  2000  Dezembro  Tocantins              20  1/1/2000
6438  2001  Dezembro  Tocantins              21  1/1/2001
6439  2002  Dezembro  Tocantins              39  1/1/2002
6440  2003  Dezembro  Tocantins             109  1/1/2003
6441  2004  Dezembro  Tocantins              96  1/1/2004
6442  2005  Dezembro  Tocantins              53  1/1/2005
6443  2006  Dezembro  Tocantins              15  1/1/2006
6444  2007  Dezembro  Tocantins              13  1/1/2007
6445  2008  Dezembro  Tocantins               7  1/1/2008
6446  2009  Dezembro  Tocantins              46  1/1/2009
6447  2010  Dezembro  Tocantins              72  1/1/2010
6448  2011  Dezembro  Tocantins             105  1/1/2011
6449  2012  Dezembro  Tocantins             128  1/1/2012
6450  2013  Dezembro  Tocantins              85  1/1/2013
6451  2014  Dezembro  Tocantins             223  1/1/2014
6452  2015  Dezembro  Tocantins             373  1/1/2015
6453  2016  Dezembro  Tocantins             119  1/1/2016

# Determing if a column contains numeric data

In [ ]:
# It isn't, let's find our why

df['number_of_fires'].str.isnumeric()

0       False
1       False
2       False
3       False
4       False
        ...
6449     True
6450     True
6451     True
6452     True
6453     True
Name: number_of_fires, Length: 6454, dtype: object

In [ ]:
df[df['number_of_fires'].str.isdigit()]

ValueError: ignored

In [ ]:
# We get the above error because our isdigit() returns Nan for blank or missing values
# To fix this we need to convert our column datatype from non-null objects to a String

df['number_of_fires'].astype(str).str.isdigit()

0       False
1       False
2       False
3       False
4       False
        ...
6449     True
6450     True
6451     True
6452     True
6453     True
Name: number_of_fires, Length: 6454, dtype: bool


- Bascially, `str.isdigit` only returns True for strings containing solely the digits 0-9. 
- By contrast, `str.isnumeric` returns True if it contains any numeric characters. e.g. '¬Ω'

# Removing unnecessary text from columns

In [ ]:
df['number_of_fires'].str.strip(" Fires")

0         0
1         0
2         0
3         0
4         0
       ...
6449    128
6450     85
6451    223
6452    373
6453    119
Name: number_of_fires, Length: 6454, dtype: object

Strip - Return a copy of the string with leading and trailing characters removed. If chars is omitted or None, whitespace characters are removed. If given and not None, chars must be a string; the characters in the string will be stripped from the both ends of the string this method is called on.

In [ ]:
# To replace column with cleaned column

df['number_of_fires'] = df['number_of_fires'].str.strip(" Fires")
df.head()

       date    month  year state number_of_fires
0  1/1/1998  Janeiro  1998  Acre               0
1  1/1/1999  Janeiro  1999  Acre               0
2  1/1/2000  Janeiro  2000  Acre               0
3  1/1/2001  Janeiro  2001  Acre               0
4  1/1/2002  Janeiro  2002  Acre               0

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6454 entries, 0 to 6453
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   date             6454 non-null   object
 1   month            6454 non-null   object
 2   year             6454 non-null   int64
 3   state            6454 non-null   object
 4   number_of_fires  6322 non-null   float64
dtypes: float64(1), int64(1), object(3)
memory usage: 252.2+ KB

In [ ]:
# We need to convert our number_of_fires column to a float data type
# Also, here's an alternative string manipulation technique we can use

df["number_of_fires"] = df["number_of_fires"].str.replace('','0').astype(float)
df.head()

       date    month  year state  number_of_fires
0  1/1/1998  Janeiro  1998  Acre              0.0
1  1/1/1999  Janeiro  1999  Acre              0.0
2  1/1/2000  Janeiro  2000  Acre              0.0
3  1/1/2001  Janeiro  2001  Acre              0.0
4  1/1/2002  Janeiro  2002  Acre              0.0

In [ ]:
# That was one way we could have handled blank data

# Handling missing data

In [ ]:
# Let's reload our dataframe
file_name = "https://raw.githubusercontent.com/rajeevratan84/datascienceforbusiness/master/amazon_fires.csv"
df = pd.read_csv(file_name, encoding = "ISO-8859-1")
new_columns = {'ano' : 'year',
               'estado': 'state',
               'mes': 'month',
               'numero': 'number_of_fires',
               'encontro': 'date'}
df.rename(columns = new_columns, inplace=True)
df['number_of_fires'] = df['number_of_fires'].str.strip(" Fires")
# Creating a true copy of our dataframe
df_copy = df.copy()
df.head()

   year    month state number_of_fires      date
0  1998  Janeiro  Acre               0  1/1/1998
1  1999  Janeiro  Acre               0  1/1/1999
2  2000  Janeiro  Acre               0  1/1/2000
3  2001  Janeiro  Acre               0  1/1/2001
4  2002  Janeiro  Acre               0  1/1/2002

In [ ]:
# Viewing the sum of missing values in each column

df.isnull().sum()

year                 0
month                0
state                0
number_of_fires    132
date                 0
dtype: int64

In [ ]:
# We can easily remove Null or NaN (not a number) values 

# Drop rows with NaN values
df = df.dropna() 
df = df.reset_index() # reset's row indexes in case any rows were dropped
df.head()

   index  year    month state number_of_fires      date
0      0  1998  Janeiro  Acre               0  1/1/1998
1      1  1999  Janeiro  Acre               0  1/1/1999
2      2  2000  Janeiro  Acre               0  1/1/2000
3      3  2001  Janeiro  Acre               0  1/1/2001
4      4  2002  Janeiro  Acre               0  1/1/2002

In [ ]:
# Let's check and see it worked

df.isnull().sum()

index              0
year               0
month              0
state              0
number_of_fires    0
date               0
dtype: int64

In [ ]:
# Alright so it worked, now let's reload the data and look at a few other methods of dealing with NaN or Null values

# Let's reload our dataframe
file_name = "https://raw.githubusercontent.com/rajeevratan84/datascienceforbusiness/master/amazon_fires.csv"
df = pd.read_csv(file_name, encoding = "ISO-8859-1")
new_columns = {'ano' : 'year',
               'estado': 'state',
               'mes': 'month',
               'numero': 'number_of_fires',
               'encontro': 'date'}
df.rename(columns = new_columns, inplace=True)
df['number_of_fires'] = df['number_of_fires'].str.strip(" Fires")
df_copy = df.copy()
df.head()

   year    month state number_of_fires      date
0  1998  Janeiro  Acre               0  1/1/1998
1  1999  Janeiro  Acre               0  1/1/1999
2  2000  Janeiro  Acre               0  1/1/2000
3  2001  Janeiro  Acre               0  1/1/2001
4  2002  Janeiro  Acre               0  1/1/2002

In [ ]:
# Create a boolean index for all null values

df['number_of_fires'].isnull()

0       False
1       False
2       False
3       False
4       False
        ...
6449    False
6450    False
6451    False
6452    False
6453    False
Name: number_of_fires, Length: 6454, dtype: bool

In [ ]:
df[df['number_of_fires'].isnull()].head(10)

     year     month    state number_of_fires      date
68   2006     Abril     Acre             NaN  1/1/2006
110  2008     Junho     Acre             NaN  1/1/2008
127  2005     Julho     Acre             NaN  1/1/2005
206  2004  Novembro     Acre             NaN  1/1/2004
217  2015  Novembro     Acre             NaN  1/1/2015
444  2002  Novembro  alagoas             NaN  1/1/2002
522  2001     Mar√ßo    Amapa             NaN  1/1/2001
550  2009     Abril    Amapa             NaN  1/1/2009
614  2013     Julho    Amapa             NaN  1/1/2013
642  2001  Setembro    Amapa             NaN  1/1/2001

# What do to with missing data?

* Remove them via .dropna(axis=0)
* Replace them with some arbitary number (e.g. an average)
* Replace them zeros, or Forward Fill (ffill) or Back Fill (backfill)

In [ ]:
# Using fillna with zeros

df['number_of_fires'].fillna(0).head()

0    0
1    0
2    0
3    0
4    0
Name: number_of_fires, dtype: object

In [ ]:
# Let's try back filling
df['number_of_fires'].fillna(method='ffill').head(70)

0     0
1     0
2     0
3     0
4     0
     ..
65    1
66    2
67    1
68    1
69    0
Name: number_of_fires, Length: 70, dtype: object

In [ ]:
# View index 444 to see how it changes
# Homework, change 444 using ffill and backfill to see how it changes
df.iloc[444]

year                   2002
month              Novembro
state               alagoas
number_of_fires         NaN
date               1/1/2002
Name: 444, dtype: object

In [ ]:
df.iloc[445]

year                   2003
month              Novembro
state               alagoas
number_of_fires          17
date               1/1/2003
Name: 445, dtype: object

In [ ]:
# let's make the assumption that blank values are 0 fires

# let's get back our copy of our original pre-processed datafrmae
df = df_copy

# replace all missing or NaN values with 0
df['number_of_fires'] = df['number_of_fires'].fillna(0)

In [ ]:
# Let's check to see if we did change our Nans to 0s
df.iloc[444]

year                   2002
month              Novembro
state               alagoas
number_of_fires           0
date               1/1/2002
Name: 444, dtype: object

# Assigning data types to our columns

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6454 entries, 0 to 6453
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   year             6454 non-null   int64
 1   month            6454 non-null   object
 2   state            6454 non-null   object
 3   number_of_fires  6454 non-null   object
 4   date             6454 non-null   object
dtypes: int64(1), object(4)
memory usage: 252.2+ KB

In [ ]:
df["number_of_fires"] = df["number_of_fires"].str.replace('','0').astype(float)

In [ ]:
df.head()

   year    month state  number_of_fires      date
0  1998  Janeiro  Acre              0.0  1/1/1998
1  1999  Janeiro  Acre              0.0  1/1/1999
2  2000  Janeiro  Acre              0.0  1/1/2000
3  2001  Janeiro  Acre              0.0  1/1/2001
4  2002  Janeiro  Acre              0.0  1/1/2002

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6454 entries, 0 to 6453
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   year             6454 non-null   int64
 1   month            6454 non-null   object
 2   state            6454 non-null   object
 3   number_of_fires  6322 non-null   float64
 4   date             6454 non-null   object
dtypes: float64(1), int64(1), object(3)
memory usage: 252.2+ KB

In [ ]:
df['month'].unique()

array(['Janeiro', 'Fevereiro', 'Mar√ßo', 'Abril', 'Maio', 'Junho', 'Julho',
       'Agosto', 'Setembro', 'Outubro', 'Novembro', 'Dezembro'],
      dtype=object)

# Replacing text in columns

In [ ]:
# Let's convert our Portuguese month names to English

month_translations = {'Janeiro': 'January',
'Fevereiro': 'February',
'Mar√ßo': 'March',
'Abril': 'April',
'Maio': 'May',
'Junho': 'June',
'Julho': 'July',
'Agosto': 'August',
'Setembro': 'September',
'Outubro': 'October',
'Novembro': 'November',
'Dezembro': 'December'}

df["month"] = df["month"].map(month_translations)
df.head()

   year    month state  number_of_fires      date
0  1998  January  Acre              0.0  1/1/1998
1  1999  January  Acre              0.0  1/1/1999
2  2000  January  Acre              0.0  1/1/2000
3  2001  January  Acre              0.0  1/1/2001
4  2002  January  Acre              0.0  1/1/2002

In [ ]:
df.isnull().sum()

year                 0
month                0
state                0
number_of_fires    132
date                 0
dtype: int64

# Further string functions on columns

In [ ]:
df['state'] = df['state'].str.title()
df['state'].unique()

array(['Acre', 'Alagoas', 'Amapa', 'Amazonas', 'Bahia', 'Ceara',
       'Distrito Federal', 'Espirito Santo', 'Goias', 'Maranhao',
       'Mato Grosso', 'Minas Gerais', 'Par√°', 'Paraiba', 'Pernambuco',
       'Piau', 'Rio', 'Rondonia', 'Roraima', 'Santa Catarina',
       'Sao Paulo', 'Sergipe', 'Tocantins'], dtype=object)

# Removing columns

In [ ]:
df.head()

   year    month state  number_of_fires      date
0  1998  January  Acre              0.0  1/1/1998
1  1999  January  Acre              0.0  1/1/1999
2  2000  January  Acre              0.0  1/1/2000
3  2001  January  Acre              0.0  1/1/2001
4  2002  January  Acre              0.0  1/1/2002

In [ ]:
# Dropping multiple columns
df = df.drop("date", axis=1) # axis = 1 so that it works across our columns
df.head()

   year    month state  number_of_fires
0  1998  January  Acre              0.0
1  1999  January  Acre              0.0
2  2000  January  Acre              0.0
3  2001  January  Acre              0.0
4  2002  January  Acre              0.0

In [ ]:
# Let's reload the data

# Let's reload our dataframe
file_name = "https://raw.githubusercontent.com/rajeevratan84/datascienceforbusiness/master/amazon_fires.csv"
df = pd.read_csv(file_name, encoding = "ISO-8859-1")
new_columns = {'ano' : 'year',
               'estado': 'state',
               'mes': 'month',
               'numero': 'number_of_fires',
               'encontro': 'date'}
df.rename(columns = new_columns, inplace=True)
df['number_of_fires'] = df['number_of_fires'].str.strip(" Fires")
df_copy = df.copy()
df.head()

   year    month state number_of_fires      date
0  1998  Janeiro  Acre               0  1/1/1998
1  1999  Janeiro  Acre               0  1/1/1999
2  2000  Janeiro  Acre               0  1/1/2000
3  2001  Janeiro  Acre               0  1/1/2001
4  2002  Janeiro  Acre               0  1/1/2002

In [ ]:
# Drop multiple columns 
df = df.drop(["year", "date"], axis=1)
df.head()

     month state number_of_fires
0  Janeiro  Acre               0
1  Janeiro  Acre               0
2  Janeiro  Acre               0
3  Janeiro  Acre               0
4  Janeiro  Acre               0

# Dropping Rows

Using the df.index function

In [ ]:
# Let's drop the first row 
df = df.drop(df.index[0])
df = df.reset_index()
df.head()

   index    month state number_of_fires
0      1  Janeiro  Acre               0
1      2  Janeiro  Acre               0
2      3  Janeiro  Acre               0
3      4  Janeiro  Acre               0
4      5  Janeiro  Acre              10

In [ ]:
# Drop multiple rows

df = df.drop(df.index[[2,3]])
df.head()

   index    month state number_of_fires
0      1  Janeiro  Acre               0
1      2  Janeiro  Acre               0
4      5  Janeiro  Acre              10
5      6  Janeiro  Acre               0
6      7  Janeiro  Acre              12

In [ ]:
# Drop a range of rows

df = df.drop(df.index[1:4])
df.head()

   index    month state number_of_fires
0      1  Janeiro  Acre               0
6      7  Janeiro  Acre              12
7      8  Janeiro  Acre               4
8      9  Janeiro  Acre               0
9     10  Janeiro  Acre               0